:PROPERTIES:
:ID:       a18bd457-477f-4454-af0d-1e6f91277820
:END:
#+language: en
#+EXPORT_FILE_NAME: ./spotting_slow_code.md
#+SUBTITLE: Using --timestamp to identify slow parts of a command

#+CALL: ../../lp.org:check-result()

#+name: init
#+BEGIN_SRC bash :results none :exports none :session a18bd457-477f-4454-af0d-1e6f91277820
  . ./sandboxing.sh
  init_faked_time
#+END_SRC

I have a command that feels slow and I want to find out why.

* setting up a command with several steps
  :PROPERTIES:
  :CREATED:  [2026-03-11 10:00]
  :CUSTOM_ID: slow-command-setup
  :END:

  Let's say I have this command that simulates several steps. It logs a
  summary at info level and detailed steps at debug level.

  #+NAME: slow-code
  #+BEGIN_SRC python :results none :exports code
    import time

    from clk.decorators import command
    from clk.log import get_logger

    LOGGER = get_logger(__name__)


    @command()
    def slowcmd():
        """A command with several steps."""
        LOGGER.debug("starting step 1: fetch config")
        LOGGER.debug("starting step 2: heavy computation")
        time.sleep(3)
        LOGGER.debug("starting step 3: write results")
        LOGGER.info("done")
  #+END_SRC

  #+NAME: export-slow
  #+BEGIN_SRC bash :results none :exports none :session a18bd457-477f-4454-af0d-1e6f91277820 :noweb yes
    cat > "${TMP}/slowcmd.py" <<'EOF'
    <<slow-code>>
    EOF
    clk command create python slowcmd --force --from-file "${TMP}/slowcmd.py"
  #+END_SRC

* the command is slow, but where?
  :PROPERTIES:
  :CREATED:  [2026-03-11 10:01]
  :CUSTOM_ID: without-timestamp
  :ID:       f0ffff12-1dbd-4ee1-b6c8-f8bb748a758f
  :END:

  Running it, all I see is "done" — no clue about what took so long:

  #+NAME: run-without-timestamp
  #+BEGIN_SRC bash :results verbatim :exports both :session a18bd457-477f-4454-af0d-1e6f91277820 :cache yes
    clk slowcmd 2>&1
  #+END_SRC

  #+RESULTS[cf58d912f8947d7907dc2f3e3219ab677f33cb3e]: run-without-timestamp
  : done

* adding --timestamp to spot the bottleneck
  :PROPERTIES:
  :CREATED:  [2026-03-11 10:02]
  :CUSTOM_ID: with-timestamp
  :END:

  Adding ~--timestamp~ prefixes each log line with a timestamp. I can confirm
  it is slow, but there is only one log line — not enough to pinpoint the cause:

  #+NAME: run-with-timestamp
  #+BEGIN_SRC bash :results verbatim :exports both :session a18bd457-477f-4454-af0d-1e6f91277820 :cache yes
    clk --timestamp slowcmd 2>&1
  #+END_SRC

  #+RESULTS[30423697148aeeb86579694152151f1a95a782e5]: run-with-timestamp
  : 2023-11-14 22:13:23,000 done

* adding --debug for the full picture
  :PROPERTIES:
  :CREATED:  [2026-03-11 10:03]
  :CUSTOM_ID: with-debug-timestamp
  :ID:       55468419-3de2-420f-b777-2332e47e1021
  :END:

  Adding ~--debug~ reveals the debug log lines. Combined with ~--timestamp~,
  I can now see exactly where the time is spent:

  #+NAME: run-with-debug-timestamp
  #+BEGIN_SRC bash :results verbatim :exports both :session a18bd457-477f-4454-af0d-1e6f91277820 :cache yes
    clk --debug --timestamp slowcmd 2>&1
  #+END_SRC

  #+RESULTS[0cc233f9e37716b9aa1dafb9a5c8b502d6ac4bc6]: run-with-debug-timestamp
  : 2023-11-14 22:13:20,000 debug: starting step 1: fetch config
  : 2023-11-14 22:13:20,000 debug: starting step 2: heavy computation
  : 2023-11-14 22:13:23,000 debug: starting step 3: write results
  : 2023-11-14 22:13:23,000 done
  : 2023-11-14 22:13:23,000 debug: command `/home/sam/prog/clk/clk/__main__.py --debug --timestamp slowcmd` run in 0.146 second

  The three-second gap between step 2 and step 3 is immediately visible,
  pointing to the heavy computation as the bottleneck.

* going deeper with --profiling
  :PROPERTIES:
  :CREATED:  [2026-03-13 10:00]
  :CUSTOM_ID: with-profiling
  :ID:       fdbd665d-0fe5-4380-92f6-c32a02633dde
  :END:

  Now I know that step 2 is the bottleneck. To understand what exactly is
  happening inside, I can use ~--profiling~ to get function-level detail:

  #+NAME: run-with-profiling
  #+BEGIN_SRC bash :results verbatim :exports both :session a18bd457-477f-4454-af0d-1e6f91277820 :cache yes
    clk --profiling slowcmd 2>&1 | grep sleep
  #+END_SRC

  #+RESULTS[42b9154a300646b380fd901becaa78a7ce8c7e40]: run-with-profiling
  : 1    0.000    0.000    0.000    0.000 /home/sam/prog/clk/clk/core.py:883(_fake_sleep)

  Here ~_fake_sleep~ appears because the test environment replaces
  ~time.sleep~ with a fake. In real life, the output would show ~{built-in
  method time.sleep}~ with 3 seconds of cumulative time, confirming where
  the bottleneck is.

#+NAME: run
#+BEGIN_SRC bash :results none :exports none :tangle ../../tests/use_cases/spotting_slow_code.sh :noweb yes :shebang "#!/usr/bin/env bash"
set -eu
  <<init>>
  <<export-slow>>
  check-result(run-without-timestamp)
  check-result(run-with-timestamp)
  check-result(run-with-debug-timestamp)
  check-result(run-with-profiling)
#+END_SRC
